of90/tutorials/rheoHeatFoam/channel/PTTLog/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;

libs ("libsampling.so");
      
setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U  
   tau
   T   
);

sets
(

    lineVert
    {
        type        lineFace;
        axis        y;

        start       ( 9.9 1e-6 0.005e-3 );
        end         ( 9.9 0.005 0.005e-3 );
       
    }
    
    lineHorz
    {
        type        lineFace;
        axis        x;
        
        start       ( 1e-6 1e-6 0.005e-3 );
        end         ( 10 1e-6 0.005e-3 );
       
    }
 
);

surfaces
(

);

